<%@ page language="java" contentType="text/html; charset=utf-8" pageEncoding="utf-8"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <title>武汉网菜网注册协议</title>
  <meta content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no" name="viewport"></meta>
  <style>
  body
  {
     font-family:"微软雅黑";
     font-size:18px;
     line-height:20px;
  }
  
  ul li
  {
     list-style:none;
     margin:2px;
     line-height:26px;
  }
  
  .content
  {
    margin-top:50px;
  }
  </style>
</head>
<body>
<div class="content">
<p>欢迎您与魔笛食材平台运营者（详见定义条款）共同签署本《注册服务协议》（下称“本协议”）并使用魔笛食材平台服务！</p>
<p>您在申请注册流程时应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。</p>
<p>当您按照注册页面提示填写信息、阅读本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与魔笛食材平台运营者达成一致，成为魔笛食材平台用户。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。</p>
<ul>
   <span>一、 定义</span>
   <li>1.1 魔笛食材平台指:魔笛食材手机客户端</li>
   <li>1.2 魔笛食材平台经营者：魔笛食材平台经营者为武汉网菜网科技有限公司</li>
   <li>1.3 魔笛食材平台服务：魔笛食材平台基于互联网，以包含魔笛食材平台网站、客户端等在内的各种形态（包括未来技术发展出现的新的服务形态）向您提供的各项服务。</li>
   <li>1.4 魔笛食材平台规则：包括在所有魔笛食材平台规则渠道内，已经发布及后续发布的全部规则、实施细则、产品说明、公告等。</li>
</ul>

<ul>
  <span>二、 协议范围</span>
  <li>
      <ul>2.1 本协议由您与魔笛食材平台经营者共同缔结，本协议对您与魔笛食材平台经营者均具有合同效力。</ul>
      <ul>2.2 补充协议 由于互联网高速发展，您与魔笛食材平台签署的本协议列明的条款并不能完整罗列并覆盖您与魔笛食材平台之间的所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，魔笛食材平台退换货规则、双方的其他约定等均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用魔笛食材平台服务，视为您同意上述补充协议。</ul>
  </li>
  <span>三、 账户注册与使用</span>
  <li>
      <ul>
        <span>3.1 用户资格</span>
        <li>您确认，在您开始注册程序使用魔笛食材平台服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。</li>
        <span>3.2 账户说明</span>
        <li>当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得魔笛食材平台账户并成为魔笛食材平台用户。</li>
        <li>您有权使用您设置或确认的魔笛食材平台手机号码（以下简称“账户名称”）及您设置的密码（账户名称及密码合称“账户”）登录魔笛食材平台。</li>
		<span>3.3 注册信息管理</span>
		<li>3.3.1 真实合法</li>
        <li>在使用魔笛食材平台服务时，您应当按魔笛食材平台页面的提示准确完整地提供您的信息（包括您的姓名及电子邮件地址、联系电话、联系地址等），以便魔笛食材平台经营者与您联系。您了解并同意，您有义务保持您提供信息的真实性及有效性。</li>
        <span>3.3.2 账户安全规范</span>
        <li>您的账户为您自行设置并由您保管，账户因您主动泄露或遭受他人攻击、诈骗等行为导致的损失及后果，均由您自行承担。除魔笛食材平台存在过错外，您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布商品和信息、购买商品及服务、接收订单、确认账单、披露信息等）负责。</li>
      </ul>
  </li>
  <span>四、所有权及知识产权条款</span>
  <li>
    <ul>
		<li>4.1您一旦接受本协议，即表明该您主动将在任何时间段在魔笛食材平台发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给魔笛食材平台所有，您同意魔笛食材平台有权就任何主体侵权而单独提起诉讼。</li>
		<li>4.2本协议已经构成《中华人民共和国著作权法》及相关法律规定的著作财产权等权利转让书面协议，其效力及于您在魔笛食材平台网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</li>
		<li>4.3魔笛食材平台运营者是魔笛食材平台的制作者,拥有此网站内容及资源的著作权等合法权利,受国家法律保护,有权不时地对本协议及魔笛食材平台的内容进行修改，并在魔笛食材平台张贴，无须另行通知您。在法律允许的最大限度范围内，魔笛食材平台运营者对本协议及魔笛食材平台内容拥有解释权。</li>
		<li>4.4除法律另有强制性规定外，未经魔笛食材平台明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用魔笛食材平台的信息内容，否则，魔笛食材平台有权追究其法律责任。</li>
		<li>4.5魔笛食材平台所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是魔笛食材平台或其内容提供者的财产，受中国和国际版权法的保护。魔笛食材平台上所有内容的汇编是魔笛食材平台的排他财产，受中国和国际版权法的保护。魔笛食材平台上所有软件都是魔笛食材平台或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。</li>
   </ul>
  </li>
   <span>五、用户依法言行义务</span>
   <span>本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</span>
   <li>
    <ul>
		<li>5.1不得利用本平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动.</li>
		<li>5.2不得干扰本平台的正常运转，不得侵入本平台及国家计算机信息系统；</li>
        <li>5.3不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；</li>
   </ul>
  </li>
  <span>您应不时关注并遵守本平台不时公布或修改的各类合法规则规定。</span>
  <span>本平台保有删除平台内各类不符合法律政策或不真实的信息内容而无须通知您的权利。</span>
  <p>六、通知的送达<p>
  <li>
  <ul>
	<li>6.1魔笛食材平台通过您提供的联系方式向您发出通知，其中以电子的方式发出的书面通知，包括但不限于在魔笛食材平台公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送信息、系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。  </li>
	<li>6.2对于在魔笛食材平台上因交易活动引起的任何纠纷，您同意司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件等现代通讯方式或邮寄方式向您送达法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、电子邮箱等联系方式为您在魔笛食材平台注册、更新时提供的手机号码、电子邮箱联系方式，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。  </li>
	<li>6.3您同意司法机关可采取以上一种或多种送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。  </li>
	<li>6.4您同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。  </li>
	<li>6.5你应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。  </li>
 </ul>
 </li>
 <span>七、您信息的保护</span>
  <li>
	<ul>
		<li>7.1您在魔笛食材平台网站进行注册、浏览、下单购物、参加活动等行为时，涉及您的真实姓名/名称、通信地址、联系电话、电子邮箱、订单详情等信息的，魔笛食材平台有权从完成交易、提供配送、售后及客户服务、开展活动、完成良好的您体验等多种角度予以收集，并将对其中涉及个人隐私信息予以严格保密。</li>
		<li>7.2魔笛食材平台保证不对外公开或向任何第三方提供您的个人信息，但是存在下列情形之一的除外：</li>
		<ul>
		    <li>1.事先获得您的明确授权；</li>
			<li>2.系为履行您的订单或保护您的合法权利所必须；</li>
			<li>3.系为履行法律义务；</li>
			<li>4.本注册协议或其他条款另有约定。</li>
		</ul>
	</ul>
  </li>
  <span>八、 您的违约<span>
  <span>8.1 违约认定<span>
  <li>
      <span>发生如下情形之一的，视为您违约：<span>
	  <ul>
	     <li>1.	使用魔笛食材平台服务时违反有关法律法规规定的；</li>
	     <li>2.	违反本协议或本协议补充协议约定的。</li>
	     <li>为适应电子商务发展和满足海量您对高效优质服务的需求，您理解并同意，魔笛食材平台可在魔笛食材平台规则中约定违约认定的程序和标准。如：魔笛食材平台可依据您的您数据与海量您数据的关系来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。</li>
	  </ul>
  </li>
  <span>九、争议解决</span>
  <p>本协议的订立、执行和解释及争议的解决均应适用中华人民共和国的法律。如就本协议内容或其执行发生任何争议，则双方应首协商解决；协商不成的，任何一方均应向武汉市江夏区人民法院提起诉讼。</p>
  <span>十、其他</span>
  <ul>
	 <li>10.1本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。</li>
	 <li>10.2本协议中的任何条款无论因何种原因被视为完全或部分无效或不具有执行力，该条应视为可分的，不影响本协议的任何其余条款的有效性、约束力及可执行性。</li>
   </ul>
</ul>
</div>
</body>
</html>